testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object       U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
4830
(
(2.286300272237464 0.0 0.0)
(2.286300272377741 0.0 0.0)
(2.286300272517682 0.0 0.0)
(2.286300272657287 0.0 0.0)
(2.286300272796555 0.0 0.0)
(2.286300272935489 0.0 0.0)
(2.286300273074088 0.0 0.0)
(2.286300273212353 0.0 0.0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 2.28630031 0.000000 0.000000 );
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
