testCase/system/minMaxComponents
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
#includeEtc     "caseDicts/postProcessing/minMax/minMaxComponents.cfg" fields ( U p );

fields          ( CH3 );


// ************************************************************************* //
