testCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

type            sets;

libs            ( "libsampling.so" );

interpolationScheme cellPoint;

setFormat       raw;

sets            ( data { type lineUniform ; libs ( "libsampling.so" ) ; axis distance ; start ( 0 0 0 ) ; end ( 1 0 0 ) ; nPoints 10240 ; } );

fields          ( T OH );


// ************************************************************************* //
